{
  "id": "085c9632-6ce2-437f-8bbb-eff4caa24aa9",
  "chunk_ix": 0,
  "created_at": "2025-08-12T03:31:29",
  "source": "web",
  "tags": [
    "development",
    "system"
  ],
  "content": "TITLE: Floodway Development – Pre-Engineering Support Pro...\n\nFloodway Development – Pre-Engineering Support Proposal\r\nGoal\r\nYou intend to obtain a building permit for development on your property at Hattiesburg, MS (PPIN: 26700, approx. 3 acres) within a FEMA-designated floodway. The planned use includes a small store on the existing slab, a boat ramp/pier, and potential residential units. \r\nScope of Work\r\nNorth Star Group will perform the following tasks:\r\n- Order FEMA hydraulic model data for the project site (cost (if any) of the data from the government paid by client).\r\n- Set up a preliminary HEC-RAS model for no-rise feasibility (for review by a licensed Professional Engineer).\r\n- Prepare scope of work documents for engineers and surveyors (optional, if client requests).\r\n- Coordinate with client-selected engineers/surveyors as needed.\r\nClient Responsibilities\r\n- Pay all direct costs for FEMA model data, engineering review, and surveying services.\r\n- Select and contract with a licensed Professional Engineer and surveyor.\r\n- Handle zoning applications or delegate to the selected engineer.\r\nPricing\r\nNorth Star Group charges for the scope listed above as follows:\r\nPhase 1 – Core Technical Support: $3,500 (plus reimbursable costs)\r\nOptional Add-On – Surveyor/Engineer Scope Prep and Utility Research: $750\r\nDeposit: 50% due at project start; balance due upon delivery of final package.\r\nExpected Savings\r\nBy completing preliminary technical preparation in-house, the licensed Professional Engineer receives a ready-to-review package, reducing their billable hours and avoiding scope creep.\r\nTimeline\r\n- Week 1: FEMA data request submitted; coordinate with surveyor (if applicable).\r\n- Weeks 2–4: Receive FEMA data, complete preliminary HEC-RAS modeling.\r\n- Weeks 5–6: Finalize documentation for engineer handoff.\r\nAuthorization\r\nTo proceed, please confirm acceptance of this proposal and remit the 50% deposit. North Star Group will begin work immediately upon receipt.\r\n\r\n\r\nAc"
}