{
  "id": "085c9632-6ce2-437f-8bbb-eff4caa24aa9",
  "chunk_ix": 1,
  "created_at": "2025-08-12T03:31:29",
  "source": "web",
  "tags": [
    "development",
    "system"
  ],
  "content": "cepted by\r\n\r\n_____________________________________________-   Date _____________\r\n\r\nExplaining the HEC-RAS Process for No-Rise Certification\r\nThis document explains, in plain language, what an HEC-RAS model is, why it is required for a No-Rise Certification in a FEMA-designated floodway, and what specific steps and files are involved. The goal is to provide clarity on the process so that all parties understand what is being delivered and what is needed to complete the work.\r\n1. What is HEC-RAS?\r\nHEC-RAS stands for 'Hydrologic Engineering Center - River Analysis System'. It is software developed by the U.S. Army Corps of Engineers to model river and stream hydraulics. For a No-Rise Certification, HEC-RAS is used to predict how a proposed development will affect water surface elevations during flood events.\r\n2. FEMA Requirements for No-Rise Certification\r\nIn a FEMA-designated floodway, any proposed development must demonstrate that it will not cause an increase in the base flood elevation (BFE). This is called a 'No-Rise Certification'. FEMA requires this certification to be supported by a hydraulic model comparing existing conditions and proposed conditions.\r\n3. Files and Data Used in HEC-RAS Modeling\r\nThe model is built from specific input files and data sources, including:\r\n- FEMA Effective Model: The official hydraulic model from FEMA’s database.\r\n- Topographic Data: Surveyed ground elevations for the site and surrounding area.\r\n- Cross Section Geometry Files (.g01, .g02, etc.): Define the shape of the river and floodplain.\r\n- Flow Files (.f01, .f02): Contain discharge rates for different flood events.\r\n- Plan Files (.p01, .p02): Define scenarios such as 'Existing' and 'Proposed' conditions.\r\n- Output Files: Generated by HEC-RAS to show water surface elevations, velocities, and impacts.\r\n4. Step-by-Step Process\r\nThe typical process for preparing a No-Rise Certification model includes:\r\n1. Request FEMA Effective Model for the project area.\r\n2. Import FEMA model int"
}