{
  "id": "16de8dc9-3d0b-4bc4-a14a-3c1067e88fe5",
  "chunk_ix": 4,
  "created_at": "2025-08-11T11:50:16",
  "source": "web",
  "tags": [
    "memory",
    "system"
  ],
  "content": "est may remain connected to the seating\r\nunit through hinge mechanisms. Hinges may include piano hinges, barrel hinges, or other hinge types\r\npositioned at various locations including the base of the backrest, along seat edges, or at end support\r\nmembers.Sliding Embodiments:\r\nSome embodiments may employ sliding mechanisms where the backrest moves along tracks, channels,\r\nor guides before pivoting or dropping into horizontal position. Movement may be linear, curved, or\r\ncombination motions.\r\nPivoting Embodiments: Various pivot mechanisms may be employed where the backrest rotates\r\naround fixed or movable pivot points to achieve horizontal positioning.\r\nQuick-Release Systems: Some embodiments may use pin systems, lever releases, or other quick-\r\ndisconnect mechanisms that allow rapid conversion while maintaining some connection to prevent loss\r\nof components.\r\nDimensional Considerations and Capacity Planning\r\nSleeping Surface Dimensions: When converted to sleeping configuration, various embodiments may\r\nprovide surfaces of different sizes:\r\nWidth: 24\", 28\", 30\", 32\", 36\" or other dimensions\r\nLength: 60\", 72\", 75\", 78\", 84\" or other dimensions\r\nThese dimensions may accommodate adult sleeping in some embodiments, child sleeping in\r\nothers, or multiple occupants in still other embodiments\r\nSeating Unit Length and Capacity Configurations: Different embodiments may be configured with\r\nvarious overall lengths to accommodate different sleeping arrangements and facility capacity\r\nrequirements:\r\nSeating Unit\r\nLength\r\nUsable\r\nSleeping\r\nLength*\r\nSleeping ConfigurationSeatingSleepingConversion\r\nExamplesCapacity**CapacityRatio\r\n6 feet (72\")62\"Child bed (60\")3 people1 child33%\r\n7 feet (84\")74\"Adult bed (72\")4 people1 adult25%\r\n8 feet (96\")86\"\r\n9 feet (108\")98\"\r\n10 feet\r\n(120\")\r\n12 feet\r\n(144\")\r\n14 feet\r\n(168\")\r\n16 feet\r\n(192\")\r\n110\"\r\nAdult bed (75\") or Two\r\nchild beds\r\nAdult bed (78\") + storage\r\nor Adult + child beds\r\nAdult (75\") + Child (60\")\r\nbeds\r\n5 people\r\n6 people\r\n1 adult or "
}