{
  "id": "2c9a0e8b-8e6b-4f28-866c-1c0cdb6d1ddd",
  "chunk_ix": 3,
  "created_at": "2025-08-11T22:06:27",
  "source": "web",
  "tags": [
    "development",
    "system"
  ],
  "content": "ssional Engineer Requirement: Analysis must be prepared by a Mississippi-licensed professional engineer using standard engineering practices as accepted by FEMA.\r\n\r\n3.2 Structural Requirements\r\nElevation Standards: Structures must be elevated to Base Flood Elevation (BFE) plus freeboard\r\n\r\nHattiesburg Requirement: 2 feet above BFE per Hattiesburg Code ยง4-29\r\nFlood Protection Elevation: BFE + 2 feet freeboard = minimum structural elevation\r\nFoundation Requirements: Structures must be designed to be anchored to resist flotation, collapse and lateral movement due to the effects of wind and flood loads\r\n\r\nAccess Requirements: NFIP requires at least one access route above BFE; address roadway elevation or alternate egress in design\r\n\r\n3.3 Allowable Construction Methods\r\nElevated Construction: Buildings on pilings/columns with open areas below BFE Flood-Resistant Materials: Below BFE elevation Breakaway Walls: If designed to ASCE 24 standards Elevated Utilities: Above BFE\r\n\r\n4. Market Analysis\r\n4.1 Housing Demand Context\r\nPopulation Impact: Hattiesburg has 46,377 residents with roughly 25 percent of property located within a special flood hazard area (SFHA)\r\n\r\nReconstruction Precedent: Many properties have been elevated due to reconstruction that came after devastating tornadoes in 2013 and 2017\r\n\r\nFlood Risk Areas: Several areas outside of the SFHA also pose a concern, as they are subject to flash flooding during intense rainfall\r\n\r\n4.2 Development Opportunity\r\nHousing Market Context: Significant housing demand exists for flood-resilient construction in Hattiesburg's flood-prone areas, with established precedent for elevated construction and municipal support for higher building standards.\r\n\r\nInsurance Economics: CRS Class 7 designation provides 15% flood insurance premium reduction, enhancing affordability of compliant elevated construction. Consider private-market flood policies for additional savings on elevated structures.\r\n\r\nMarket Data Needed: Recommend obtaining r"
}