{
  "id": "2c9a0e8b-8e6b-4f28-866c-1c0cdb6d1ddd",
  "chunk_ix": 0,
  "created_at": "2025-08-11T22:06:27",
  "source": "web",
  "tags": [
    "development",
    "system"
  ],
  "content": "TITLE: Michael Hoffman <<redacted.email>>\r Sat, Jul 12,...\n\nMichael Hoffman <<redacted.email>>\r\nSat, Jul 12, 9:21 AM\r\nto Kent\r\n\r\ngood morning. I’m up and about now so, do you wanna shoot for noon central?\r\n\r\n\r\n\r\nMichael Hoffman President North Star Group, Inc. <redacted.phone> <redacted.email>\r\n\r\n\r\nOn Sat, Jul 12, 2025 at 7:01 AM Kent Batman <<redacted.email>> wrote:\r\nAwesome!  I want to talk today sometime and I believe Ricky does as well.  He and I need to visit first so wont be too early.\r\nFrom: Michael Hoffman <<redacted.email>>\r\nSent: Saturday, July 12, 2025 1:35 AM\r\nTo: Kent Batman <<redacted.email>>\r\nSubject: Floodway Development Feasibility Analysis\r\n \r\nHi Kent, I spent a little time reviewing the floodway / buildable issues.  Nothing unexpected except that I am not able to verify their non-buildable area.  I assumed there is a non-buildable area around the marina, and perhaps some of the river's edge, but the federal records I searched do not delineate the non-buildable area.  I think we can revisit the non-buildable area when we have our facts in hand.  Hattisberg's opinion might stay, but I don't see a justification for 6-7 acres.  Once we get engineers involved, we may be able to lessen the non-buildable area.  See the paper below for a preliminary assessment.   My suggestion is that we go along to get along, build rapport, but always express to Hattisberg that we want our engineers to professionally assess the land use prior to final determination of buildable area.   \r\n\r\nCheers, \r\nMichael Hoffman\r\n<redacted.phone>\r\n<redacted.email>\r\nMSHATM6 (1).jpg\r\nHattiesburg, Mississippi - PPINs 26700 & 26786\r\nExecutive Summary: This analysis demonstrates that residential development within FEMA-designated floodways in Hattiesburg, Mississippi is legally permissible under federal and state regulations, provided specific engineering requirements are met. The recommended approach is to develop preliminary project concepts and cost estimates while working cooperatively"
}