{
  "id": "35dc73d9-6d72-45ca-bbd7-4476d483ded3",
  "chunk_ix": 1,
  "created_at": "2025-08-11T09:46:35",
  "source": "web",
  "tags": [
    "development"
  ],
  "content": "ance: PHAs with clean audits, proactive leadership, and community development track record. 1.5 Action To-Do List 1. Shortlist Target PHAs: Identify top 10 initial prospects in target states with leadership contact info. 2. Develop Standard PHA Pitch Deck: Emphasizing cash flow, asset quality, and public benefit. 3. Financial Model Template: Customizable to each PHA’s property portfolio and financing environment. 4. Rain Garden Add-On Module: Optional proposal insert detailing benefits, budget, and grant options. 5. Prepare Technical SIP Specifications: Highlighting construction speed, cost savings, and resilience. 6. Arrange Introductory Meetings: Leverage regional contacts and industry conferences. 7. Compile Funding Menu: Including HUD programs, bond structures, and USDA grants. 1.6 Appendix Placeholder Appendix A-1: Target PHA Shortlist (Top 10 initial focus list) — names, addresses, leadership contacts. Appendix A-2: Example Financial Model. Appendix A-3: SIP Technical Data Sheet.\n\nPublic Housing Authority (PHA) Strategy\r\n1.1 Overview\r\nThis program targets the top-performing PHAs in the Southeast U.S. and select other\r\nregions, offering a turnkey mixed-income housing solution that delivers immediate and\r\nlong-term benefits without requiring RAD conversion or disruptive restructuring.\r\nCore deliverables for PHAs:\r\n- Development fee revenue: Lump-sum income during construction phase.\r\n- Ongoing net positive cash flow: From managed rentals or lease-purchase units.\r\n- Asset quality upgrade: New housing stock built with structural insulated panels (SIPs) for\r\ndurability, energy efficiency, and storm resilience.\r\nWhy PHAs benefit:\r\n- Maintains ownership and control of land and buildings.\r\n- Improves financial standing with new, predictable revenue streams.\r\n- Supports mission objectives with improved living conditions and optional community\r\ngardens.\r\n- Enhances public perception and political capital through visible, public-benefit projects.\r\n1.2 Core Offer &amp; Fi"
}