{
  "id": "35dc73d9-6d72-45ca-bbd7-4476d483ded3",
  "chunk_ix": 0,
  "created_at": "2025-08-11T09:46:35",
  "source": "web",
  "tags": [
    "development"
  ],
  "content": "TITLE: Public Housing Authority (PHA) Strategy 1.1 Overview This program targets the top-performing PHAs in the Southeast U.S. and select other regions, offering a turnkey mixed-income housing solution that delivers immediate and long-term benefits without requiring RAD conversion or disruptive restructuring. Core deliverables for PHAs: - Development fee revenue: Lump-sum income during construction phase. - Ongoing net positive cash flow: From managed rentals or lease-purchase units. - Asset quality upgrade: New housing stock built with structural insulated panels (SIPs) for durability, energy efficiency, and storm resilience. Why PHAs benefit: - Maintains ownership and control of land and buildings. - Improves financial standing with new, predictable revenue streams. - Supports mission objectives with improved living conditions and optional community gardens. - Enhances public perception and political capital through visible, public-benefit projects. 1.2 Core Offer &amp; Financial Model - Turnkey delivery: From site planning through certificate of occupancy. - Financing: Combination of PHA equity, private capital, and federal/state housing funds. - Revenue structure: - Development fee payable to PHA during construction. - Net operating income share to PHA post-stabilization. - Potential grant supplementation for public benefit features (gardens, community spaces, resilience upgrades). 1.3 Value-Added Options - Community Edible Rain Gardens: PHA-controlled gardens that enhance food access and community engagement. - Energy &amp; Resilience Features: Solar power, battery backup, advanced insulation, and water management. - Technology Integration: Mapping tools for site planning of public spaces, gardens, and stormwater management. 1.4 Target Market Initial Focus: - Geography: Alabama, Georgia, Mississippi, Northern Florida, North &amp; South Carolina. - Size: Medium-sized PHAs (avoiding large metro bureaucracies) with capacity for 50–150 unit developments.  - Perform"
}