{
  "id": "35dc73d9-6d72-45ca-bbd7-4476d483ded3",
  "chunk_ix": 3,
  "created_at": "2025-08-11T09:46:35",
  "source": "web",
  "tags": [
    "development"
  ],
  "content": "ial Model.\r\nAppendix A-3: SIP Technical Data Sheet.\r\nThis program targets the top-performing PHAs in the Southeast U.S. and select other\r\nregions, offering a turnkey mixed-income housing solution that delivers immediate and\r\nlong-term benefits without requiring RAD conversion or disruptive restructuring.\r\nCore deliverables for PHAs:\r\n- Development fee revenue: Lump-sum income during construction phase.\r\n- Ongoing net positive cash flow: From managed rentals or lease-purchase units.\r\n- Asset quality upgrade: New housing stock built with structural insulated panels (SIPs) for\r\ndurability, energy efficiency, and storm resilience.\r\nWhy PHAs benefit:\r\n- Maintains ownership and control of land and buildings.\r\n- Improves financial standing with new, predictable revenue streams.\r\n- Supports mission objectives with improved living conditions and optional community\r\ngardens.\r\n- Enhances public perception and political capital through visible, public-benefit projects.\r\n1.2 Core Offer &amp; Financial Model\r\n- Turnkey delivery: From site planning through certificate of occupancy.\r\n- Financing: Combination of PHA equity, private capital, and federal/state housing funds.\r\n- Revenue structure:\r\n- Development fee payable to PHA during construction.\r\n- Net operating income share to PHA post-stabilization.\r\n- Potential grant supplementation for public benefit features (gardens, community spaces,\r\nresilience upgrades).\r\n1.3 Value-Added Options\r\n- Community Edible Rain Gardens: PHA-controlled gardens that enhance food access and\r\ncommunity engagement.\r\n- Energy &amp; Resilience Features: Solar power, battery backup, advanced insulation, and\r\nwater management.\r\n- Technology Integration: Mapping tools for site planning of public spaces, gardens, and\r\nstormwater management.\r\n1.4 Target Market\r\nInitial Focus:\r\n- Geography: Alabama, Georgia, Mississippi, Northern Florida, North &amp; South Carolina.\r\n- Size: Medium-sized PHAs (avoiding large metro bureaucracies) with capacity for 50–150\r\nuni"
}