{
  "id": "6b121b08-b4f0-48d2-94a1-9b12dedcc431",
  "chunk_ix": 5,
  "created_at": "2025-08-11T11:15:47",
  "source": "web",
  "tags": [
    "development",
    "memory",
    "system"
  ],
  "content": "airhope, AL 36532\r\n<redacted.email>\r\n<redacted.phone>\r\n\r\nEmail 3 - Anniston Housing Authority\r\nSubject: Alternative Housing Development Model - No LIHTC Required\r\nDear Mr. Fortner,\r\nI'm reaching out because we've developed a financial model for mixed-income housing development that might benefit Anniston Housing Authority. As a mid-sized Alabama community with steady industrial growth and proximity to major employment centers, Anniston represents an ideal market for innovative housing approaches that serve both working families and affordable housing residents.\r\nUnlike traditional approaches, this model doesn't rely on Low-Income Housing Tax Credits, making it more straightforward to implement.\r\nKey Benefits:\r\n\r\nDeveloper fee revenue directly to your housing authority\r\nVery low-cost affordable housing production\r\nHigh, consistent cash flow generation\r\nFollows best practices for public housing authorities that have diversified their portfolio, which according to Novogradac CPA firm are \"in much better shape to weather potential storms\" and demonstrate \"the power of diversification and the power of a growth mindset in terms of trying to provide housing needs in a variety of ways and not solely reliant on HUD funding\"\r\n\r\nThe model creates sustainable, mixed-income communities that avoid concentrated poverty while generating significant ongoing revenue for housing authorities like yours.\r\nWould you be open to a brief call to discuss how this might work for Anniston? Please see the attached PDF explainer document for details on the financial structure and implementation approach.\r\nBest regards,\r\nMichael Hoffman\r\nNorth Star Group, Inc.\r\nFairhope, AL 36532\r\n<redacted.email>\r\n<redacted.phone>\r\n\r\nEmail 4 - Housing Authority of Columbus\r\nSubject: Alternative Housing Development Model - No LIHTC Required\r\nDear Ms. Walters,\r\nI'm reaching out because we've developed a financial model for mixed-income housing development that might benefit the Housing Authority of Columbus. As on"
}