{
  "id": "6b121b08-b4f0-48d2-94a1-9b12dedcc431",
  "chunk_ix": 4,
  "created_at": "2025-08-11T11:15:47",
  "source": "web",
  "tags": [
    "development",
    "memory",
    "system"
  ],
  "content": "nt: Mobile Housing Authority Mixed-Income Development Proposal.pdf\r\nYou're absolutely right - using the same Mobile Housing Authority PDF makes sense. The financial model and structure are the same, and each PHA can see how it would apply to their specific situation. Should I draft the remaining 6 emails for the contacts we have?RetryMHyesEditEmail 2 - Tuscaloosa Housing Authority\r\nSubject: Alternative Housing Development Model - No LIHTC Required\r\nDear Mr. Hall,\r\nI'm reaching out because we've developed a financial model for mixed-income housing development that might benefit Tuscaloosa Housing Authority. With the University of Alabama driving significant workforce demand and Tuscaloosa's growing industrial sector, there's a clear need for housing solutions that serve both university employees, local workforce, and affordable housing residents.\r\nUnlike traditional approaches, this model doesn't rely on Low-Income Housing Tax Credits, making it more straightforward to implement.\r\nKey Benefits:\r\n\r\nDeveloper fee revenue directly to your housing authority\r\nVery low-cost affordable housing production\r\nHigh, consistent cash flow generation\r\nFollows best practices for public housing authorities that have diversified their portfolio, which according to Novogradac CPA firm are \"in much better shape to weather potential storms\" and demonstrate \"the power of diversification and the power of a growth mindset in terms of trying to provide housing needs in a variety of ways and not solely reliant on HUD funding\"\r\n\r\nThe model creates a mixed-income structure particularly well-suited for university towns like Tuscaloosa, serving both professional workforce homebuyers and affordable rental residents in the same community.\r\nWould you be open to a brief call to discuss how this might work for Tuscaloosa's market? Please see the attached PDF explainer document for details on the financial structure and implementation approach.\r\nBest regards,\r\nMichael Hoffman\r\nNorth Star Group, Inc.\r\nF"
}