{
  "id": "92da003f-ddc8-4d4e-a4c1-56016b12d2ea",
  "chunk_ix": 0,
  "created_at": "2025-08-12T01:42:47",
  "source": "web",
  "tags": [
    "development",
    "historic"
  ],
  "content": "TITLE: Floodway Development – Pre-Engineering Feasibility &amp; Permit\n\nFloodway Development – Pre-Engineering Feasibility &amp; Permit\r\nPreparation\r\nThis document outlines the steps required to move the proposed Leaf River floodway site\r\nfrom its current state to a point where a professional engineer can finalize designs and\r\nsecure a building permit. The approach is designed to reduce total project costs by\r\ncompleting critical groundwork and data collection before the engineering phase begins.\r\nScope of Work\r\nNorth Star Group will act as the front-end coordinator, assembling all prerequisite data and\r\nensuring completeness before engaging licensed engineers, architects, and surveyors. The\r\nscope includes:\r\n1. Coordinating the No-Rise Study base data collection (topo, FEMA maps, historical data).\r\n2. Reviewing and documenting utility availability (sewer, water, power, gas/alternative\r\nenergy).\r\n3. Identifying zoning and land-use constraints for the intended density and amenities.\r\n4. Preparing a preliminary site concept including proposed structures, access, and boat\r\nramp.\r\n5. Compiling all findings into a single package for engineering use.\r\nDivision of Responsibilities\r\nNorth Star Group will:\r\n- Order and coordinate a boundary and topographic survey.\r\n- Gather and organize FEMA floodway/floodplain data and elevation certificates.\r\n- Initiate and document utility provider discussions.\r\n- Create preliminary site layouts and identify possible permit barriers.\r\n- Deliver a complete pre-engineering package to the design team.\r\nThe Licensed Engineer will:\r\n- Perform hydraulic/hydrologic modeling for the No-Rise Certification.\r\n- Design structural and site improvements in compliance with floodway regulations.\r\n- Stamp and submit the Floodplain Development Permit and related applications.\r\n- Coordinate directly with city/county permitting authorities for final approval.\r\nProcess Steps\r\n1. Confirm zoning, density allowances, and floodway building restrictions.\r\n2. Inves"
}