{
  "id": "9a18924e-e52a-45d1-be06-7c6186a01048",
  "chunk_ix": 0,
  "created_at": "2025-08-11T12:51:20",
  "source": "web",
  "tags": [
    "development",
    "system"
  ],
  "content": "TITLE: 90-Day Financial Plan – Refuge Chapel &amp; Related Project Development\n\n90-Day Financial Plan – Refuge Chapel &amp; Related Project Development\r\nThis document outlines a targeted 90-day financial strategy to generate revenue for\r\nNorthstar through the development, marketing, and positioning of the Refuge Chapel\r\nconcept and related products (e.g., convertible pews) in the Carolinas region and beyond.\r\nThe plan is structured for clarity and accessibility while retaining the technical depth\r\nneeded for execution.\r\n1. Immediate Revenue Opportunities (Weeks 1–3)\r\nThe first priority is to identify and pursue opportunities that can generate income quickly,\r\neven before final contracts are secured. Actions include:\r\n• Direct outreach to pew manufacturers (e.g., Sauder, New Holland, Ratigan-Schottler) to\r\nsecure pricing agreements or referral commissions for Northstar.\r\n• Engaging large church general contractors operating in North and South Carolina who\r\nhave structural insulated panel (SIP) experience and can secure performance bonds.\r\n• Positioning Northstar as the grant facilitation and design-integration partner for refuge-\r\ncapable chapel projects, creating a value proposition that justifies a consulting or facilitation\r\nfee.\r\n2. Mid-Term Revenue Actions (Weeks 4–8)\r\nOnce initial manufacturer and contractor conversations are underway, focus shifts to\r\ncreating tangible project opportunities:\r\n• Confirm at least one qualified contractor interested in collaborating on a refuge chapel\r\nbuild, potentially using the Charlotte RTS project as a reference concept without committing\r\nproject-specific details.\r\n• Offer preliminary scope-of-work packages for interested clients at a fixed consulting rate.\r\n• Build a list of churches planning construction in 2025–2026 and reach out to their boards\r\nor building committees with the refuge concept pitch.\r\n• Explore other institutional or municipal applications for convertible pew/cot systems to\r\nbroaden market reach.\r\n3. Long"
}