{
  "id": "a0961713-45bb-42a5-8476-99708ac4118b",
  "chunk_ix": 0,
  "created_at": "2025-08-11T09:42:47",
  "source": "web",
  "tags": [
    "development",
    "system"
  ],
  "content": "TITLE: master sales strategy\n\nMaster Strategy Document\r\nThis document is a comprehensive, modular strategy guide for internal use, capturing the\r\ncore logic, shared DNA, tactical approaches, and actionable steps discussed. Sections are\r\nnumbered for ease of replacement and updating. Appendices will be added as the\r\norganization grows, including patents, technical specs, and contact lists.\r\n1. Company Scope &amp; Shared DNA\r\nOur company operates as a systems integrator with multiple product lines that share a\r\ncommon DNA: We identify leverage points where a single strategic action benefits multiple\r\nstakeholders, and we design offerings that create immediate, tangible value for the people\r\nwe approach. This induces them to become advocates and informal sales representatives,\r\nknowingly or unknowingly.\r\nThe shared DNA elements:\r\n• Always offer a &#39;gift&#39; or value that benefits the target immediately.\r\n• Structure offerings so the target has an incentive to promote our services.\r\n• Avoid unsustainable subsidies — products must stand on their own merits.\r\n• Maintain modularity so different product lines can be approached independently but\r\nsupport each other when beneficial.\r\nAction Items\r\n1. Document the &#39;gift&#39; for each product line.\r\n2. Create a standard pitch template embedding the shared DNA concepts.\r\n3. Develop an onboarding guide for new hires explaining the shared DNA.\r\n2. Product Line: Refuge Chapels (Pew Strategy)\r\nRefuge Chapels combine religious use with disaster refuge capability. The initial sales entry\r\npoint is through pew manufacturers, who already have direct relationships with churches\r\nplanning construction.\r\nKey leverage: Pew manufacturers benefit from higher sales if churches build, and churches\r\nbenefit from added grant opportunities if they include refuge features. We bridge this by\r\nintroducing grant consulting as a value-add to pew sales.\r\nAction Items\r\n1. Build a shortlist of regional/national pew manufacturers.\r\n2. Develop joint"
}