{
  "id": "c895612a-b84c-4c04-a4ac-6cd513355af1",
  "chunk_ix": 0,
  "created_at": "2025-08-12T01:41:53",
  "source": "web",
  "tags": [
    "development",
    "system"
  ],
  "content": "TITLE: Hattiesburg Floodway Development Feasibility &amp; Permit Preparation\n\nFloodway Development Feasibility &amp; Permit Preparation\r\nScope of Work – Revised\r\n1. Permit Prerequisite Coordination (Required Tasks)\r\nThese are the essential steps to get the project to the point where a licensed engineer and\r\narchitect can complete the permit package.\r\n• Topographic &amp; Boundary Survey – Coordinate with a licensed surveyor to obtain current\r\nsite elevations, property boundaries, and key physical features.\r\n• No-Rise Study Data Collection &amp; Preliminary Model Work – Identify, order, and organize\r\nFEMA-required data sets for engineering analysis, including running the existing hydraulic\r\nmodeling software to prepare a preliminary, non-engineered model for handoff to the\r\nlicensed engineer.\r\n• Floodway/Floodplain Confirmation – Verify site location and conditions using FEMA maps\r\nand local floodway data.\r\n• Utility Access Confirmation – Document existing or planned connections for:\r\n- Electrical power\r\n- Potable water supply\r\n- Wastewater disposal (municipal, septic, or holding tank)\r\n- Optional: Gas service feasibility\r\n• Local Forms &amp; Zoning Review – Gather and review City of Hattiesburg / Forrest County\r\nbuilding, zoning, and floodplain management forms and requirements.\r\n2. Value-Add Explorations (Optional / Creativity-Driven Tasks)\r\nThese items are outside the bare-minimum scope but can help inform smarter long-term\r\nplanning, cost savings, and resilience.\r\n• Solar + Generator Feasibility Study – Estimate power requirements for proposed\r\nstructures (1–12 homes + small store). Recommend solar array size, battery capacity, and\r\nbackup generator needs.\r\n• Off-Grid or Semi-Off-Grid Wastewater Options – Compare holding tanks, septic systems,\r\nand small package plants for floodway compliance.\r\n• Site Access &amp; Erosion Control – Initial concepts for boat ramp slope, surfacing, and runoff\r\nmitigation.\r\n• Flood-Resilient Site Layout Concepts – Rough layouts for m"
}