{
  "id": "c985c115-e3ed-411e-8c24-0ffcd0f41d6a",
  "chunk_ix": 0,
  "created_at": "2025-08-11T10:00:26",
  "source": "web",
  "tags": [
    "system"
  ],
  "content": "TITLE: PROVISIONAL PATENT APPLICATION Title: iVerify: Field-to-Ledger Product Verification System\n\nPROVISIONAL PATENT APPLICATION\r\nTitle: iVerify: Field-to-Ledger Product Verification System\r\n\r\nFIELD OF THE INVENTION\r\nThis invention relates generally to systems and methods for verifying the origin, handling, and\r\ncompliance conditions of agricultural and/or mined products. More particularly, the invention provides\r\nan integrated, multi-step process that combines physical verification methods, compliance monitoring,\r\nand blockchain-based custody records with optional payment and market access tools for small-scale\r\nproducers, especially in low-connectivity regions.\r\n\r\nBACKGROUND OF THE INVENTION\r\nIndustries such as agriculture and artisanal or small-scale mining (ASM) face strict buyer and regulatory\r\nrequirements to prove product origin, handling practices, and absence of prohibited activities such as\r\nchild labor. Regulations like the European Union Deforestation Regulation (EUDR) and conflict mineral\r\nlaws require verifiable mapping, monitoring, and chain-of-custody documentation.\r\nWhile individual technologies such as GPS mapping or tamper-evident seals exist, they are often\r\ndeployed in isolation, require continuous internet access, or are tailored to large-scale corporate\r\nbuyers. Smallholders and ASM producers lack integrated tools that meet these compliance\r\nrequirements while also enabling direct participation in premium markets.\r\nThere is a need for an integrated, modular system and process that operates in low-connectivity\r\nenvironments, captures verifiable data at multiple points, binds that data to an immutable record, and\r\nuses that record to facilitate payments and market storytelling.\r\n\r\nSUMMARY OF THE INVENTION\r\nIn one embodiment, the invention provides a multi-step, modular process for product verification and\r\ncompliance monitoring that incorporates both known and novel elements into a single, unified\r\nworkflow. The system operates offline-first, s"
}