{
  "id": "cfad5ba9-728d-43fa-8c65-94e0c38e4d87",
  "chunk_ix": 0,
  "created_at": "2025-08-11T21:25:54",
  "source": "web",
  "tags": [
    "development",
    "historic",
    "system"
  ],
  "content": "TITLE: about michael hoffman\n\nMichael Hoffman is an accomplished real estate developer, inventor, and affordable housing advocate with over three decades of experience. As founder and CEO of North Star Group, Inc., he leads initiatives to deliver cost-efficient, modular housing solutions addressing the U.S. housing crisis. After the personal loss of his son in 2023, Hoffman redirected his focus to Affordable Housing with innovative, sustainable development strategies.\r\n\r\nEducation & Early Career\r\nHeld early teenage jobs including commercial fishing in Alaska and IBM reader sorder (check sorting) at the Federal Reserve Bank\r\nFounded Hoffman’s Brothers Contracting in 1975, specializing in rehab, remodeling and renovations of residential properties e\r\nStudied political science and history at the University of South Alabama\r\nOwned, Managed and renovated residential properties in Mobile for over a decade\r\nReal Estate Development Career\r\n1980s–1990s: Early Development\r\nShifted to commercial real estate after 1986 tax reforms\r\nObtained broker license and founded Southeast Capital Investments\r\nRepresented national retail clients including Wendy’s and Captain D’s\r\nMentored by (and partnered with) Terry Hogan (municipal securities) and Gordon Henderson (real estate commissioner)\r\n1990s–2008: Expansion Period\r\nCompleted five Walmart assignments across Alabama\r\nDeveloped properties for CVS, Walgreens, Starbucks and others\r\nPartner on a three man team that renovated 400,000 SF Huntsville Mall, Focused on construction management and remediation\r\nRedeveloped a 50,000 SF department store in Anniston Alabama\r\nCreated the “LAVDEC” model for site evaluation: Location, Access, Visibility, Demographics, Economics, Competition\r\nPost-2008 Diversification\r\nEngaged by Monday Properties (NY hedge fund) on a North Dakota apartment complex development\r\nDeveloped skills in institutional reporting and structured finance\r\nInvention & Innovation\r\nIssued U.S. Patents (Hydra Heating Industries, LLC)"
}