{
  "id": "cfad5ba9-728d-43fa-8c65-94e0c38e4d87",
  "chunk_ix": 1,
  "created_at": "2025-08-11T21:25:54",
  "source": "web",
  "tags": [
    "development",
    "historic",
    "system"
  ],
  "content": "\r\nTitle\tPatent No.\tYear\tCategory\tLink\r\nInductive Heater for Fluids\t10,560,984 B2\t2020\tIndustrial Heating\tView\r\nInductively Heated Tank Cars\t10,525,988 B2\t2020\tTransportation\tView\r\nActuating Inductor Placement Assembly\t10,556,601 B2\t2020\tIndustrial Equipment\tView\r\nMagnetic Closures for Pipe Insulation\t10,197,210 B2\t2019\tPipe Insulation\tView\r\nMagnetic Insulation\t9,914,284 B2\t2018\tPipe Insulation\tView\r\nMagnetic Clasps for Insulation\t9,868,268 B2\t2018\tPipe Insulation\tView\r\nFrac and Storage Tank Exchanger\t9,920,605 B2\t2018\tFluid Management\tView\r\nFlow Balanced Frac Tank Farm\t9,915,127 B2\t2018\tFluid Management\tView\r\nPool/Large Tank/Pond Hub Exchanger\t9,909,811 B2\t2018\tWater Systems\tView\r\nPool/Large Tank/Pond Exchanger\t9,551,206 B2\t2017\tWater Systems\tView\r\nDisplacement Welding Chamber\t10,232,459 B2\t2019\tWelding Systems\tView\r\nProvisional & Pending Patents\r\nIntegrated Sustainable Housing System – U.S. Provisional Application No. 63/767,801\r\nFully Integrated Reinforced Modular SIP System (FIRM) – Patent pending\r\nPublications & White Papers\r\nNSGIA Document Library – White papers, financial models, housing decks, and technical reports\r\nCooking Love – A book for little chefs by Michael Hoffman\r\nAffordable Housing Focus\r\nNorth Star Group, Inc.\r\nMichael Hoffman now concentrates on developing sustainable, tech-enabled affordable housing. His approach integrates:\r\n\r\nStructural insulated panels (SIPs) for energy efficiency and speed\r\nSolar integration and load control systems to manage utility expenses\r\nModular fabrication to reduce skilled labor requirements\r\nFinancing models that retain long-term nonprofit or public ownership\r\nSerenity Village Roadmap\r\nMontgomery, AL – Proposed 21-acre mixed-use development.\r\nMobile, AL – Proposed 120-unit quadruplex affordable housing project\r\nPalestine, TX – Drafted Literacy-centered housing initiative integrating food, wellness, and education\r\nDetroit, MI – Drafted Adaptive reuse of historic school facility for modular housing and community infra"
}