{
  "id": "d139db53-95ca-493f-80f2-6a25565e758f",
  "chunk_ix": 1,
  "created_at": "2025-08-11T11:59:56",
  "source": "web",
  "tags": [
    "system"
  ],
  "content": "66\r\n4451BECC4BE6541E546BE6367B9E7A9562C06C8C5E4352E45\r\n547C1775EA454CB88730B2D64BC01E\r\nConvertible_Pew_Patent_Figur\r\nes.pdfED433881B6BEDC6FC2C8DEF8FBE9216FA25A3DE42BA4E01\r\n51ABC569ABD00E5F1F41FC2816059133D5966685C63142277B\r\n8304B81705A706C6BDD3ADFE70FD537\r\nThis Acknowledgement Receipt evidences receipt on the noted date by the USPTO of the indicated documents, characterized\r\nby the applicant, and including page counts, where applicable. It serves as evidence of receipt similar to a Post Card, as\r\ndescribed in MPEP 503.\r\nNew Applications Under 35 U.S.C. 111\r\nIf a new application is being filed and the application includes the necessary components for filing date (see 37 CFR 1.53(b)-(d)\r\nand MPEP 506), a Filing Receipt (37 CFR 1.54) will be issued in due course and the date shown on this Acknowledgement\r\nReceipt will establish the filing date of the application\r\nNational Stage of an International Application under 35 U.S.C. 371\r\nIf a timely submission to enter the national stage of an international application is compliant with the conditions of 35 U.S.C.\r\n371 and other applicable requirements a Form PCT/DO/EO/903 indicating acceptance of the application as a national stage\r\nsubmission under 35 U.S.C. 371 will be issued in addition to the Filing Receipt, in due course.\r\nNew International Application Filed with the USPTO as a Receiving Office\r\nIf a new international application is being filed and the international application includes the necessary components for an\r\ninternational filing date (see PCT Article 11 and MPEP 1810), a Notification of the International Application Number and of the\r\nInternational Filing Date (Form PCT/RO/105) will be issued in due course, subject to prescriptions concerning national security,\r\nand the date shown on this Acknowledgement Receipt will establish the international filing date of the application."
}