{
  "id": "da130a3e-f58c-44a3-8277-fe932486b66d",
  "chunk_ix": 4,
  "created_at": "2025-08-11T22:09:09",
  "source": "web",
  "tags": [
    "breakthrough",
    "development",
    "historic",
    "system"
  ],
  "content": "ce training partnerships\r\n\r\nwith local colleges\r\n\r\nU.S. Federal\r\nGovernment\r\n\r\nHUD (HOME/ESG), USDA 502 Direct loans, FEMA BRIC grants, EPA green\r\ninfrastructure, ITC solar tax credits, LWCF park funding\r\n\r\nOpportunity: This partnership directly aligns with national funding priorities under HUD’s PRO Housing\r\ninitiative, FEMA’s resilience infrastructure strategy, and ARPA guidelines for equitable housing investments.\r\nMOU Objectives (City + County)\r\n• Define regulatory pathways and funding timelines (e.g. rezoning, inspections, utility approvals)\r\n• Set affordability thresholds tied to HUD AMI levels and housing cost-burden metrics\r\n• Clarify roles in infrastructure delivery long-term maintenance e.g. stormwater, roads, trails, and park\r\nspace.\r\n• Unlock incentives for modular innovation through expedited plan review, in-kind support, and layered\r\nsubsidies\r\n• Position the region for broader strategic investments—housing, recreation, and workforce.\r\nMarina, Riverwalk & Leaf River Activation Strategy\r\nThe public marina, riverwalk, and trailhead infrastructure deliver high-value public access and align with the $18M\r\nLeaf River Active Transportation Network proposed by Forrest County. This section of the MOU can help unlock\r\nfunding from multiple programs by bundling public recreation, climate adaptation, and economic revitalization\r\ninto one interjurisdictional strategy.\r\nCity & County Responsibilities:\r\n• In-kind grading and utility coordination (marina slope, trailheads, access ramps)\r\n• ARPA or CDBG allocations for dock infrastructure, greenway lighting, riverbank stabilization\r\n• Trail network integration through sidewalk connectivity and signage improvements\r\n• Environmental permitting and oversight in collaboration with the U.S. Army Corps of Engineers\r\n(wetlands), FEMA (flood resilience), and EPA (green infrastructure)\r\nFunding-Eligible Enhancements:\r\n• Floating docks, ADA ramps, and riverfront rest stops\r\n• Boardwalk extensions linking the Eagles Flock commun"
}