{
  "id": "da130a3e-f58c-44a3-8277-fe932486b66d",
  "chunk_ix": 0,
  "created_at": "2025-08-11T22:09:09",
  "source": "web",
  "tags": [
    "breakthrough",
    "development",
    "historic",
    "system"
  ],
  "content": "TITLE: Eagles Flock to Woodstock\r \r Executive Summary: Ea...\n\nEagles Flock to Woodstock\r\n\r\nExecutive Summary: Eagles Flock to Woodstock represents a once-in-a-generation opportunity for the City of\r\nHattiesburg, Forrest County, and the State of Mississippi to lead the nation in delivering sustainable, affordable,\r\nand climate-resilient housing. This visionary initiative blends modular homebuilding, circular infrastructure, and\r\nequitable land use into a replicable model that is both shovel-ready and community-driven. Set on 32.88 acres of\r\nunderutilized, flood-prone land in Ward 2, the development transforms dormant public assets into a vibrant,\r\nmixed-income neighborhood—without placing additional burden on local taxpayers.\r\nIt addresses urgent needs:\r\n• Over 50% of Hattiesburg renters are cost-burdened\r\n• Energy-efficient, storm-resilient homes remain out of reach for many working families\r\n• Flood-prone infill land and public riverfronts remain underutilized\r\n• Cities need scalable solutions aligned with HUD, FEMA, and state infrastructure priorities\r\nEagles Flock to Woodstock offers a bold, equitable, and achievable solution. Through a robust public-private\r\npartnership, the development will deliver:\r\n• 70+ elevated modular homes priced within HUD income limits, built to IRC and FEMA standards\r\n• A public marina, riverwalk, and boardwalk corridor connected to the Leaf River Active Transportation\r\nNetwork\r\n• The EcoFlow system—a circular infrastructure pilot that reclaims treated wastewater for agriculture,\r\nirrigation, and ecological value\r\n• A modular construction model that reduces total development cost (TDC) while raising design, efficiency,\r\nand durability standards\r\n• A fully integrated affordability framework offering rental, lease-to-own, and capped-resale homeownership\r\npathways\r\nThe development is strategically positioned to:\r\n• Leverage HOME, ARPA, ESG, USDA 502 Direct, FEMA, and LIHTC-lite programs\r\n• Generate local employment in green construction, "
}