{
  "id": "da130a3e-f58c-44a3-8277-fe932486b66d",
  "chunk_ix": 7,
  "created_at": "2025-08-11T22:09:09",
  "source": "web",
  "tags": [
    "breakthrough",
    "development",
    "historic",
    "system"
  ],
  "content": " model has been thoughtfully named to evoke the surrounding ecology and the vision of a rooted, resilient\r\ncommunity. These models—ranging from compact studios to spacious two-bedroom homes—are designed to meet\r\n\r\nHUD affordability thresholds while exceeding expectations in quality, efficiency, and durability. Built with steel-\r\nreinforced frames, SIP construction, and elevated on permanent foundations, each home is engineered for\r\n\r\nMississippi’s climate and certified to IRC 2021 standards. .... Model Collection:\r\nModel Name Sq Ft Description\r\nThe Willow 320 Compact and fortified—ideal for workforce housing or individual occupancy.\r\nThe Cypress 320 Bright and airy layout with natural light—perfect for hospitality or rental.\r\nThe Magnolia 360 1BR model with bump-out, named for Mississippi’s native pine forests.\r\nThe River Birch 400 Two bump-outs offer flexible living; shaped by the river’s flowing form.\r\nThe Sycamore 640 Efficient 2BR home, elevated and peaceful—ideal for small families.\r\nThe Oakview 960 Flagship home—two bedrooms, two baths, designed for comfort and legacy.\r\nEach home is built to HUD income-based pricing targets and can be financed through FHA, VA, USDA 502\r\nDirect, or conventional products. Ownership pathways include traditional mortgage purchase, lease-to-own\r\nagreements with rent-to-equity features, or capped resale with soft second mortgages to ensure long-term\r\naffordability.\r\nAffordability & Sustainability Tools\r\n• HOME, ESG, ARPA, USDA 502 Direct, and LIHTC-lite layered subsidies\r\n• Deed restrictions, shared equity agreements, and soft second mortgages\r\n• Modular and SIP construction for lower cost of ownership\r\n• Integrated rainwater catchment, rooftop solar readiness, and high-efficiency HVAC\r\n• Cross-subsidy strategy: moderate-income units help fund deeply affordable homes\r\nTogether, these tools allow Eagles Flock to Woodstock to remain accessible to Hattiesburg’s working families\r\nwhile advancing the city’s long-term resilience, affordab"
}