{
  "id": "da130a3e-f58c-44a3-8277-fe932486b66d",
  "chunk_ix": 2,
  "created_at": "2025-08-11T22:09:09",
  "source": "web",
  "tags": [
    "breakthrough",
    "development",
    "historic",
    "system"
  ],
  "content": "rtage\r\n\r\n• According to the U.S. Census and HUD CHAS data, over 50% of Hattiesburg renters are housing cost-\r\nburdened, spending more than 30% of their income on rent.\r\n\r\n• Roughly 1 in 4 renters are severely burdened, paying over 50% of income.\r\n• The average monthly rent in Hattiesburg increased by nearly 18% between 2021 and 2024, outpacing local\r\nwage growth.\r\n• Housing availability for low- to moderate-income households remains constrained.\r\n• As of 2024, there are fewer than 35 publicly subsidized units available per 100 extremely low-income\r\nhouseholds in the Hattiesburg metro area.\r\n• The Hattiesburg Housing Authority waitlist remains closed due to overwhelming demand, with hundreds of\r\neligible households unable to access rental assistance or housing vouchers.\r\n2. Strategic Infill Opportunity\r\n\r\n• The 32.88-acre project site sits in Ward 2, a historically underserved district with large tracts of flood-\r\nprone, underutilized public and semi-public land.\r\n\r\n• Rather than pursuing greenfield expansion that strains city services, Eagles Flock to Woodstock leverages\r\nflood-adapted construction to redevelop land already within city limits, reducing sprawl while increasing\r\nhousing supply.\r\n• Because the site is adjacent to existing sewer, power, and water infrastructure, per-unit infrastructure cost is\r\nsubstantially lower than new exurban development—yielding both short-term savings and long-term\r\nserviceability.\r\n3. Alignment with Local and Regional Goals\r\n• The City of Hattiesburg’s Comprehensive Plan 2040 calls for:\r\no Expansion of affordable housing options\r\no Redevelopment of underused floodplain parcels\r\no Promotion of walkable, mixed-use neighborhoods near the Leaf River corridor\r\n• Forrest County’s investment in the Leaf River Active Transportation Network is a complementary\r\ninitiative. The project aligns by:\r\no Activating the riverfront with a marina and trailhead\r\no Creating safe, accessible connections to the River Avenue pedestrian bridge\r\no Adding"
}