{
  "id": "db5b2559-e70a-42bc-8270-5689d8c42d1d",
  "chunk_ix": 0,
  "created_at": "2025-08-11T22:14:41",
  "source": "web",
  "tags": [
    "development",
    "historic",
    "system"
  ],
  "content": "TITLE: Housing Shortage Crisis in Hattiesburg: The\r Case...\n\nHousing Shortage Crisis in Hattiesburg: The\r\nCase for Workforce Housing Development\r\nA White Paper on Affordable Housing Needs in Hattiesburg, Mississippi\r\n\r\nExecutive Summary\r\nBottom Line Up Front: Mississippi faces a severe housing shortage with only 59 affordable\r\nhomes per 100 extremely low-income households, while Hattiesburg's 13,110+ University of\r\nSouthern Mississippi students, healthcare workers earning $39.77/hour average, and essential\r\nworkers struggle to find affordable housing in a market where 66% of extremely low-income\r\nrenters spend over half their income on housing.\r\nThe housing crisis in Hattiesburg, Mississippi reflects a broader national emergency that\r\ndemands immediate action. With 102,509 extremely low-income renter households statewide\r\nand only 59 affordable units per 100 households who need them, Mississippi ranks among states\r\nwith significant housing shortages. In Hattiesburg specifically, this translates to critical gaps for\r\nworkforce populations including 8,100+ USM students living off-campus (81% of total enrollment),\r\nhealthcare professionals averaging $39.77 hourly wages, and essential workers whose salaries of\r\n$22.17/hour average cannot compete with rising rental costs of $917-$1,160 monthly.\r\nThis white paper documents the scope of housing shortage nationally, regionally, and locally,\r\nanalyzing cost burden impacts on target demographics and presenting the economic case for\r\ninnovative workforce housing solutions using Structural Insulated Panel (SIP) construction to\r\naddress documented market needs.\r\n\r\nThe Housing Gap Analysis\r\n\r\nReformed Theological Seminary Student Housing Proposal\r\n\r\nNational Housing Shortage Crisis\r\nThe United States faces an unprecedented housing shortage of 7.1 million rental homes\r\naffordable and available to extremely low-income renters (those earning at or below 30% of area\r\nmedian income or the federal poverty line). This shortage has grown"
}