{
  "id": "f05c1c5f-5c7f-406e-993c-24facd9c6442",
  "chunk_ix": 1,
  "created_at": "2025-08-13T15:30:50",
  "source": "human",
  "tags": [
    "development",
    "system"
  ],
  "content": "eed an engineering overlay to confirm roof and solar qualification.\r\n\r\n \r\n\r\nPlease prepare a proposal that includes:\r\n\r\nDevelopment Fee Structure – systems design, integration, and project management.\r\nGrant Writing – outside ITC. considering a performance-based incentive model (e.g., % of capture).\r\nSystems Integration Scope – acoustical, structural, and HVAC/electrical specifications, plus a repeatable integration model for future projects.\r\nThis includes modeling how the building structure itself—walls, floors, and volumes—work together acoustically from the design phase, with custom modules that extend proven acoustic principles to building-scale integration.\r\nKey Benefits – precision-manufactured components, SIP construction (200+ mph wind resistance), GAF solar roof with battery backup, and 24V DC lighting for efficiency and safety.\r\n \r\n\r\nAlso, please update the Chapel proposal by replacing “DGEN Energy Partners” with “Power of Clean Energy” in the HVAC & Plenum tab (screenshot attached).\r\n\r\nReference scope:   Link:  https://grants.nsgia.com/church?pass=rts2025\r\n\r\n \r\n\r\nAesthetics is a critical path item—once validated by C&P and approved by the Charlotte Campus President, we can ensure the chapel meets performance and design goals while reinforcing RTS’s world-class, premium brand . It is my hope, the Charlotte PUD can be presented for funding in September, with the completion timeline still to be determined, followed by a Pre-Construction Services Agreement, integration scope development and completion, and securing a contractor GMP.\r\n\r\n \r\n\r\nThank you again for your commitment to helping us deliver a chapel that aligns with our vision, maximizes funding opportunities, and strengthens RTS’s long-term mission impact.\r\n\r\n \r\n\r\nsignature_2765690175\r\n\r\nRicky Rayborn\r\nChief Operations Officer\r\nReformed Theological Seminary, Institutional\r\n601.923.1643 | <redacted.email> | rts.edu\r\n\r\nA mind for truth. A heart for God.®"
}