{
  "id": "f41f0e7a-823a-4e5a-bdf8-835dc6448dae",
  "chunk_ix": 0,
  "created_at": "2025-08-11T09:55:27",
  "source": "web",
  "tags": [
    "development",
    "system"
  ],
  "content": "TITLE: Request for Quote (RFQ) Templates\n\nRequest for Quote (RFQ) Templates\r\nThese RFQ templates are designed for three distinct initiatives within our strategic plan.\r\nThey share a common introduction outlining our organization and objectives, but each has a\r\ncustomized scope of work to ensure vendors can provide relevant, comparable responses.\r\nAbout Us\r\nNorth Star Group, Inc. is a development and technical execution firm specializing in\r\naffordable housing, community resilience infrastructure, and technology-driven solutions.\r\nOur work spans structural insulated panel (SIP) housing, stormwater management systems,\r\nand traceability tools for agricultural supply chains. We prioritize projects that deliver\r\nmeasurable public benefit while offering vendors clear, well-defined scopes.\r\n\r\nRFQ Template 1: Chapel Refuge Construction\r\nPurpose: Solicit bids for the construction of a chapel designed to double as a FEMA-spec\r\nrefuge facility.\r\nVendor Types: SIP panel manufacturers, general contractors, roofing/solar installers, HVAC\r\nspecialists.\r\nScope of Work\r\n- Provide complete construction services for a chapel of approximately [X] sq. ft.\r\n- Incorporate FEMA P-361 or ICC 500 standards for refuge areas.\r\n- Install GAF solar roofing system or equivalent.\r\n- Integrate HVAC and backup power systems sized for refuge occupancy.\r\n- Coordinate with design team to meet aesthetic and functional requirements.\r\nVendor Response Requirements\r\n- Company background and relevant project experience.\r\n- Detailed cost estimate with line items.\r\n- Proposed project schedule.\r\n- References from similar projects.\r\n- Proof of insurance and bonding capacity.\r\n\r\nRFQ Template 2: Edible Rain Garden / PHA Community Garden\r\nPurpose: Request proposals for design, supply, and installation of edible rain gardens at\r\npublic housing sites.\r\nVendor Types: Landscape architects, rain garden installers, native/edible plant nurseries,\r\nirrigation suppliers.\r\nScope of Work\r\n\r\n- Develop planting and installation"
}