{
  "id": "f93f21ea-729f-4e8e-9010-8382957b6b2f",
  "chunk_ix": 0,
  "created_at": "2025-08-11T09:39:48",
  "source": "web",
  "tags": [
    "development",
    "system"
  ],
  "content": "TITLE: Sales Strategy – Multi-Funnel Plan (Refuge Churches, PHAs, Traceability/Mapping) Executive Summary\n\nSales Strategy – Multi-Funnel Plan (Refuge Churches, PHAs,\r\nTraceability/Mapping)\r\nExecutive Summary\r\nThis document consolidates the sales strategy discussed across the three core lines of\r\nbusiness: 1) Refuge Churches (convertible pew-to-bed systems via channel partners), 2)\r\nPublic Housing Authority (PHA) development using the AVC structure and a developer-fee-\r\nfirst approach, and 3) Traceability &amp; Mapping (affordable, field-first GPS mapping and\r\nreporting). It defines shared principles (“gift-first”), lays out repeatable funnels, specifies\r\noutreach assets, and provides a Southeast-focused target roster for PHA outreach.\r\nShared DNA (Sales Operating Principles)\r\n- Lead with a tangible GIFT that immediately improves the counterparty’s position (cash,\r\ncompliance, or capability).\r\n- Present the NEAREST executable lever (not the vision): a purchase order, a funded feature,\r\nor a pilot with clear metrics.\r\n- Make spreading the idea align with THEIR interest (vendors sell more, PHAs close budget\r\ngaps, co-ops reach compliance).\r\n- Keep each line modular; avoid forced cross-sell. Use common process assets (playbooks,\r\nkits, cadence).\r\nFunnel 1 – Refuge Churches (Convertible Pews via Channel Partners)\r\nContext &amp; Problem\r\nAccess to churches is limited; contractors and manufacturers already have trusted\r\nrelationships. Churches need resilience upgrades that are fundable and actionable, not\r\nabstract plans.\r\nLever\r\nOrderable, grant-eligible convertible pew-to-bed system (install + training).\r\nGift\r\nPartner-ready grant brief: exact programs, eligibility cues, and a templated budget to fund\r\npew conversions. A vendor can attach this to their proposal immediately.\r\nAudience &amp; Channels\r\n- Primary: pew manufacturers, church-building contractors, acoustic and geothermal\r\nvendors.\r\n- Secondary: denominational boards, seminaries, disaster-relief coordinators.\r\n\r"
}